<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"ca27d673511141e2ed6a0d691bf256bd1d21585867cfab8f56b627712e254244","plan_job_ref":"Job Staging Image Build & Push #44 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439103004","plan_hash":"edc2ab1b48cc8a28ae09febcc208d2197ccba37ac0e1017c48983e3b9ff3a3b8","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_lb_association will be created
+   resource "aws_autoscaling_attachment" "asg_lb_association" {
+       autoscaling_group_name = (known after apply)
+       id                     = (known after apply)
+       lb_target_group_arn    = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/3c273cd8ab1a4464"
    }

  # aws_autoscaling_group.ASG_config will be created
+   resource "aws_autoscaling_group" "ASG_config" {
+       arn                              = (known after apply)
+       availability_zones               = (known after apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       desired_capacity_type            = "units"
+       force_delete                     = true
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 300
+       health_check_type                = "ELB"
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 3
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = "fastapi-ASG-dev"
+       name_prefix                      = (known after apply)
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = (sensitive value)
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       launch_template {
+           id   = (known after apply)
+           name = (known after apply)
        }

+       tag {
+           key                 = "AmazonECSManaged"
+           propagate_at_launch = true
+           value               = "true"
        }

+       timeouts {
+           delete = "15m"
        }
    }

  # aws_ecs_capacity_provider.customProvider will be created
+   resource "aws_ecs_capacity_provider" "customProvider" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "CustomEC2Provider"
+       tags_all = {
+           "Environment" = "Dev Environment"
        }

+       auto_scaling_group_provider {
+           auto_scaling_group_arn         = (known after apply)
+           managed_termination_protection = "DISABLED"

+           managed_scaling {
+               instance_warmup_period    = (known after apply)
+               maximum_scaling_step_size = (known after apply)
+               minimum_scaling_step_size = (known after apply)
+               status                    = "ENABLED"
+               target_capacity           = 100
            }
        }
    }

  # aws_ecs_cluster_capacity_providers.Provider_config will be created
+   resource "aws_ecs_cluster_capacity_providers" "Provider_config" {
+       capacity_providers = [
+           "CustomEC2Provider",
        ]
+       cluster_name       = "fastapi-cluster"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "CustomEC2Provider"
+           weight            = 100
        }
    }

  # aws_launch_template.ASG_template will be created
+   resource "aws_launch_template" "ASG_template" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       image_id        = (sensitive value)
+       instance_type   = "t2.micro"
+       latest_version  = (known after apply)
+       name            = "LaunchTemplateECR"
+       name_prefix     = (known after apply)
+       tags_all        = {
+           "Environment" = "Dev Environment"
        }

+       iam_instance_profile {
+           name = "InstanceRoleForECS"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Staging Image Build & Push #44](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439103004)